Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: If you are not in an interactive shell, ``dpkg-reconfigure`` will not work as expected. To add the locale you will need to edit ``/etc/locale.gen`` file to add/uncomment the ``en_US.UTF-8`` locale. A simple way to do this as root is::
it_it: Se non si utilizza una shell interattiva, ``dpkg-reconfigure`` non funzionerà come previsto. Per aggiungere la localizzazione, è necessario modificare il file ``/etc/locale.gen`` per aggiungere/decommentare la localizzazione ``en_US.UTF-8``. Un modo semplice per farlo come root è il seguente::

source: If you are using Fedora or RedHat, put it here::
it_it: Se si usa Fedora o Red Hat, lo si inserisce qui::

source: If you are using Fedora or a RedHat distribution, run the following::
it_it: Se si usa Fedora o una distribuzione Red Hat, eseguire il seguente comando::

source: If you are using Ubuntu or Debian, you will need to enable the config and module for Apache::
it_it: Se si usa Ubuntu o Debian, si dovrà abilitare la configurazione e il modulo per Apache::

source: If you are using Ubuntu, run the following::
it_it: Se si usa Ubuntu, eseguire il seguente comando::

source: If you are using openSUSE, put it here::
it_it: Se si usa openSUSE, lo si inserisce qui:

source: If you are using openSUSE, run the following::
it_it: Se si usa openSUSE, eseguire il seguente comando::

source: If you are using the :ref:`ref-classes-autotools` class, you can add additional configuration options by using the :term:`EXTRA_OECONF` or :term:`PACKAGECONFIG_CONFARGS` variables. For information on how this variable works within that class, see the :ref:`ref-classes-autotools` class :oe_git:`here </openembedded-core/tree/meta/classes-recipe/autotools.bbclass>`.
it_it: Se si utilizza la classe :ref:`ref-classes-autotools`, è possibile aggiungere ulteriori opzioni di configurazione tramite le variabili :term:`EXTRA_OECONF` o :term:`PACKAGECONFIG_CONFARGS`. Per informazioni sul funzionamento di queste variabili all'interno della classe, consultare la documentazione della classe :ref:`ref-classes-autotools` :oe_git:`qui </openembedded-core/tree/meta/classes-recipe/autotools.bbclass>`.

source: If you are using the ``linux-yocto`` recipe, enable it by adding the following in a :term:`configuration file` or in a ``.bbappend``::
it_it: Se si utilizza la ricetta ``linux-yocto``, abilitarla aggiungendo quanto segue in un :term:`configuration file` o in un file ``.bbappend``::

source: If you are working behind a firewall and your build host is not set up for proxies, you could encounter problems with the build process when fetching source code (e.g. fetcher failures or Git failures).
it_it: Se si lavora dietro un firewall e l'host di build non è configurato per i proxy, si potrebbero riscontrare problemi con il processo di build durante il recupero del codice sorgente (ad esempio, errori di fetcher o errori di Git).

source: If you attempt to send patches to a list you haven't subscribed to, your email will be returned as undelivered.
it_it: Se si tenta di inviare patch a una lista a cui non si è iscritti, l'email verrà restituita come non recapitata.

source: If you branch didn't need a description in the previous step::
it_it: Se il branch non necessitava di una descrizione nel passaggio precedente::

source: If you build as you normally would, without specifying any recipes in the :term:`LICENSE_FLAGS_ACCEPTED` variable, the build stops and provides you with the list of recipes that you have tried to include in the image that need entries in the :term:`LICENSE_FLAGS_ACCEPTED` variable. Once you enter the appropriate license flags into it, restart the build to continue where it left off. During the build, the prompt will not appear again since you have satisfied the requirement.
it_it: Se si esegue la compilazione normalmente, senza specificare alcuna ricetta nella variabile :term:`LICENSE_FLAGS_ACCEPTED`, la compilazione si interrompe e viene visualizzato l'elenco delle ricette che si è tentato di includere nell'immagine e che richiedono l'inserimento nella variabile :term:`LICENSE_FLAGS_ACCEPTED`. Una volta inseriti i flag di licenza appropriati, riavviare la compilazione per riprendere da dove si era interrotta. Durante la compilazione, il prompt non verrà più visualizzato poiché il requisito è stato soddisfatto.

source: If you change the information in your layer index server, refresh the Toaster database by running the following command:
it_it: Se si modificano le informazioni nel server di indice dei layer, aggiornare il database di Toaster eseguendo il seguente comando:

source: If you do accidentally delete files here, you will need to force them to be re-created. In order to do that, you will need to know the target that produced them. For example, these commands rebuild and re-create the kernel files::
it_it: Se si eliminano accidentalmente dei file in questa directory, sarà necessario forzarne la ricreazione. Per farlo, è necessario conoscere il target che li ha generati. Ad esempio, questi comandi ricompilano e ricreano i file del kernel::

source: If you do include a bootable image as part of the BSP and the image was built by software covered by the GPL or other open source licenses, it is your responsibility to understand and meet all licensing requirements, which could include distribution of source files.
it_it: Se si include un'immagine avviabile nel BSP e tale immagine è stata creata con software coperto da licenza GPL o altre licenze open source, è una propria responsabilità comprendere e rispettare tutti i requisiti di licenza, che potrebbero includere la distribuzione dei file sorgente.

source: If you do not know your proxy settings, consult your local network infrastructure resources and get that information. A good starting point could also be to check your web browser settings. Finally, you can find more information on the ":yocto_wiki:`Working Behind a Network Proxy </Working_Behind_a_Network_Proxy>`" page of the Yocto Project Wiki.
it_it: Se non si conoscono le impostazioni del proxy, consulta le risorse della propria infrastruttura di rete locale per ottenere queste informazioni. Un buon punto di partenza potrebbe essere anche controllare le impostazioni del browser web. Infine, si possono trovare maggiori informazioni nella pagina ":yocto_wiki:`Working Behind a Network Proxy </Working_Behind_a_Network_Proxy>`" nello Yocto Project Wiki.

source: If you encounter problems, please go to :yocto_bugs:`Yocto Project Bugzilla <>` and submit a bug. We are interested in hearing about your experience. For information on how to submit a bug, see the Yocto Project :yocto_wiki:`Bugzilla wiki page </Bugzilla_Configuration_and_Bug_Tracking>` and the ":doc:`/contributor-guide/report-defect`" section in the Yocto Project and OpenEmbedded Contributor Guide.
it_it: In caso di problemi, si prega di visitare :yocto_bugs:`Yocto Project Bugzilla <>` e segnalare un bug. Siamo interessati a conoscere la vostra esperienza. Per informazioni su come segnalare un bug, consultare la pagina wiki di Yocto Project :yocto_wiki:`Bugzilla wiki page </Bugzilla_Configuration_and_Bug_Tracking>` e la sezione ":doc:`/contributor-guide/report-defect`" nella Guida per i Collaboratori di Yocto Project e di OpenEmbedded.

source: If you examine the files saved to disk, you see multiple files, one per CPU and with the device name as the first part of the filename::
it_it: Esaminando i file salvati su disco, si noteranno più file, uno per ogni CPU, con il nome del dispositivo come prima parte del nome del file::

source: If you explored the previous links, you discovered some areas where many layers that work with the Yocto Project exist. The :yocto_git:`Source Repositories <>` also shows layers categorized under "Yocto Metadata Layers."
it_it: Esplorando i link precedenti, avrete scoperto alcune aree in cui sono presenti molti layer compatibili con Yocto Project. Anche i :yocto_git:`Source Repositories <>` mostrano i layer categorizzati sotto "Yocto Metadata Layers".

source: If you filled a description for your branch, you will want to generate a cover letter too::
it_it: Se invece è stata inserita una descrizione per il branch, si dovrà generare anche una lettera di presentazione::

source: If you find a security flaw: a crash, an information leakage, or anything that can have a security impact if exploited in any Open Source software built or used by the Yocto Project, please report this to the Yocto Project Security Team. If you prefer to contact the upstream project directly, please send a copy to the security team at the Yocto Project as well. If you believe this is highly sensitive information, please report the vulnerability in a secure way, i.e. encrypt the email and send it to the private list. This ensures that the exploit is not leaked and exploited before a response/fix has been generated.
it_it: Se si riscontra una falla di sicurezza: un crash, una fuga di informazioni o qualsiasi altra vulnerabilità che, se sfruttata, possa avere un impatto sulla sicurezza di qualsiasi software open source sviluppato o utilizzato da Yocto Project, si prega di segnalarla al Yocto Project Security Team. Se si preferisce contattare direttamente il progetto upstream, si prega di inviare una copia anche al team di sicurezza di Yocto Project. Se si ritiene che si tratti di informazioni altamente sensibili, segnalare la vulnerabilità in modo sicuro, ad esempio crittografando l'e-mail e inviandola alla lista privata. In questo modo si evita che la vulnerabilità venga divulgata e sfruttata prima che sia stata elaborata una risposta o una soluzione.

source: If you get an error connecting to the target e.g.::
it_it: Se si riscontra un errore di connessione al target, ad esempio::

source: If you have a :term:`Build Directory` containing multiple machines, you need to have the :term:`MACHINE` you're connecting to selected, and the kernel in that machine's :term:`Build Directory` must match the kernel on the booted system exactly, or you'll get the above ``crosstap`` message when you try to call a script.
it_it: Se si ha una :term:`Build Directory` contenente più macchine, si deve selezionare la :term:`MACHINE` a cui ci si sta connettendo e il kernel nella :term:`Build Directory` di quella macchina deve corrispondere esattamente al kernel del sistema avviato, altrimenti si riceverà il messaggio ``crosstap`` di cui sopra quando si tenta di eseguire uno script.

source: If you have a shortage of disk space, see the ":doc:`/dev-manual/disk-space`" section of the Development Tasks Manual.
it_it: Se lo spazio su disco è insufficiente, consultare la sezione ":doc:`/dev-manual/disk-space`" del Manuale dei Task di Sviluppo.

source: If you have completely unrelated sets of changes to submit, you should even create one branch for each set.
it_it: Se si ha un set di modifiche completamente indipendenti da inviare, si dovrebbe addirittura creare un branch per ogni set.

source: If you have multiple patches and a cover letter, you can send patches for all the commits between the reference branch and the tip of your branch::
it_it: Se si hanno più patch e una lettera di presentazione, si possono inviare le patch per tutti i commit tra il branch di riferimento e la fine del proprio branch::

source: If you intend to submit a new recipe that neither fits in :term:`OpenEmbedded-Core (OE-Core)`, nor into :oe_git:`meta-openembedded </meta-openembedded/>`, you should look for a suitable layer in https://layers.openembedded.org. If similar recipes can be expected, you may consider :ref:`dev-manual/layers:creating your own layer`.
it_it: Se si intende inviare una nuova ricetta che non rientra né in :term:`OpenEmbedded-Core (OE-Core)`, né in :oe_git:`meta-openembedded </meta-openembedded/>`, è necessario cercare un layer adatto su https://layers.openembedded.org. Se si prevedono ricette simili, si può consultare la sezione :ref:`dev-manual/layers:creating your own layer`.

source: If you like Sysprof's ``caller-oriented`` display, you may be able to approximate it in other tools as well. For example, ``perf report`` has the ``-g`` (``--call-graph``) option that you can experiment with; one of the options is ``caller`` for an inverted caller-based call graph display.
it_it: Se si apprezza la visualizzazione di Sysprof ``caller-oriented``, si potrebbe essere in grado di ottenere un risultato simile anche con altri strumenti. Ad esempio, ``perf report`` ha l'opzione ``-g`` (``--call-graph``) con cui si può sperimentare; una delle opzioni è ``caller`` per una visualizzazione del grafico delle chiamate basata sui chiamanti invertita.

source: If you need to distribute a BSP and include bootable images or build kernel and filesystems meant to allow users to boot the BSP for evaluation purposes, you should put the images and artifacts within a ``binary/`` subdirectory located in the ``meta-bsp_root_name`` directory.
it_it: Se è necessario distribuire un BSP e includere immagini avviabili o compilare kernel e filesystem destinati a consentire agli utenti di avviare il BSP a scopo di valutazione, è necessario inserire le immagini e gli artefatti in una sottocartella ``binary/`` situata nella directory ``meta-bsp_root_name``.

source: If you need to download Git, it is recommended that you add Git to your system through your distribution's "software store" (e.g. for Ubuntu, use the Ubuntu Software feature). For the Git download page, see https://git-scm.com/download.
it_it: Se è necessario scaricare Git, si consiglia di aggiungerlo al sistema tramite i "software store" della propria distribuzione (ad esempio, per Ubuntu, utilizzare la funzionalità Ubuntu Software). Per la pagina di download di Git, consultare https://git-scm.com/download.

source: If you need to remove something, the following works::
it_it: Se si deve rimuovere qualcosa, il seguente comando funziona::

source: If you neither can use a local MTA nor SMTP, make sure you use an email client that does not touch the message (turning spaces in tabs, wrapping lines, etc.). A good mail client to do so is Pine (or Alpine) or Mutt. For more information about suitable clients, see `Email clients info for Linux <https://www.kernel.org/doc/html/latest/process/email-clients.html>`__ in the Linux kernel sources.
it_it: Se non si può utilizzare né un MTA locale né SMTP, si deve utilizzare un client di posta elettronica che non modifichi il messaggio (invertendo gli spazi in tabulazioni, mandando a capo le righe, ecc.). Un buon client di posta per questo scopo è Pine (o Alpine) o Mutt. Per ulteriori informazioni sui client compatibili, consultare la sezione `Informazioni sui client di posta elettronica per Linux <https://www.kernel.org/doc/html/latest/process/email-clients.html>`__ nei sorgenti del kernel Linux.

source: If you plan on customizing a recipe for a particular BSP, you need to do the following:
it_it: Se si intende personalizzare una ricetta per un BSP specifico, è necessario procedere come segue:

source: If you prefer to run non-interactively, you can run a command like the following:
it_it: Se si preferisce eseguire il programma in modalità non interattiva, si può eseguire un comando come il seguente:

source: If you prefer to set up your builds in a different top directory, for example ``$HOME/bitbake-builds``, you can set it with the :ref:`bitbake:ref-bbsetup-command-settings` command:
it_it: Se si preferisce configurare le build in una directory principale diversa, ad esempio ``$HOME/bitbake-builds``, la si può impostare col comando :ref:`bitbake:ref-bbsetup-command-settings`:

source: If you select any of the other release options, Toaster will fetch the tip of your selected release from the upstream :yocto_git:`Yocto Project repository <>` every time you run a build. Fetching this tip effectively means that if your selected release is updated upstream, the Git revision you are using for your builds will change. If you are doing development locally, you might not want this change to happen. In that case, the "Local Yocto Project" release might be the right choice.
it_it: Se si seleziona una qualsiasi delle altre opzioni di release, Toaster scaricherà l'ultima versione della release selezionata dal repository upstream :yocto_git:`Yocto Project repository <>` ogni volta che si esegue una build. Scaricare questa ultima versione significa che, se la release selezionata viene aggiornata a monte, la revisione Git utilizzata per le build cambierà. Se si sta sviluppando in locale, si potrebbe non volere che ciò accada. In tal caso, la release "Local Yocto Project" potrebbe essere la scelta giusta.

source: If you use such clients, just include the patch in the body of your email.
it_it: Se si utilizzano client di questo tipo, è sufficiente includere la patch nel corpo dell'e-mail.

source: If you use the ``tools-profile`` method, you don't need to build an sdk image --- the tracing and profiling tools will be included in non-sdk images as well e.g.::
it_it: Se si utilizza il metodo ``tools-profile``, non è necessario creare un'immagine sdk: gli strumenti di tracing e profilazione saranno inclusi anche nelle immagini non sdk, ad esempio::

source: If you used ``pip3``, which is recommended, to set up the Toaster system dependencies, you need be sure the local user path is in your ``PATH`` list. To append the pip3 local user path, use the following command::
it_it: Se è stato usato ``pip3``, come consigliato, per configurare le dipendenze di sistema di Toaster, il percorso dell'utente locale deve essere presente nell'elenco ``PATH``. Per aggiungere il path dell'utente locale pip3, utilizzare il seguente comando::

source: If you want Toaster to use your layer index, you must host the web application in a server to which Toaster can connect. You also need to give Toaster the information about your layer index. In other words, you have to configure Toaster to use your layer index. This section describes two methods by which you can configure and use your layer index.
it_it: Affinché Toaster utilizzi il proprio indice di layer, si deve ospitare l'applicazione web su un server a cui Toaster possa connettersi. Si devono anche fornire a Toaster le informazioni sull'indice di layer. In altre parole, è necessario configurare Toaster per utilizzare il proprio indice di layer. Questa sezione descrive due metodi per configurare e utilizzare l'indice di layer.

source: If you want more conceptual or background information on the Yocto Project, see the :doc:`/overview-manual/index`.
it_it: Per maggiori informazioni concettuali o di base sullo Yocto Project, consultare la sezione :doc:`/overview-manual/index`.

source: If you want some task to always be considered "out of date", you can mark it with the :ref:`nostamp <bitbake-user-manual/bitbake-user-manual-metadata:variable flags>` varflag. If some other task depends on such a task, then that task will also always be considered out of date, which might not be what you want.
it_it: Se si desidera che un task venga sempre considerata "obsoleta", è possibile contrassegnarla con il "varflag" [flag di variabile] :ref:`nostamp <bitbake-user-manual/bitbake-user-manual-metadata:variable flags>`. Se un altro task dipende da tale task, anche quest'ultimo verrà sempre considerato obsoleta, il che potrebbe non essere l'effetto desiderato.

source: If you want to avoid a package being registered as providing a particular shared library (e.g. because the library is for internal use only), then add the library to :term:`PRIVATE_LIBS` inside the package's recipe.
it_it: Per evitare che un pacchetto venga registrato come fornitore di una particolare libreria shared (ad esempio, perché la libreria è destinata esclusivamente all'uso interno), è necessario aggiungere la libreria a :term:`PRIVATE_LIBS` all'interno della ricetta del pacchetto.

source: If you want to build any other layers, you will need to manually import them into your Toaster project, using the "Import layer" page.
it_it: Per creare altri layer, sarà necessario importarli manualmente nel progetto Toaster utilizzando la pagina "Import layer".

source: If you want to learn more about running QEMU, see the :ref:`dev-manual/qemu:using the quick emulator (qemu)` chapter in the Yocto Project Development Tasks Manual.
it_it: Per ulteriori informazioni sull'esecuzione di QEMU, consultare il capitolo :ref:`dev-manual/qemu:using the quick emulator (qemu)` nel Manuale di Sviluppo dei Task di Yocto Project.

source: If you want to save time and not be forced to remember the right options to use with ``git send-email``, you can use Git configuration settings.
it_it: Per risparmiare tempo ed evitare di dover ricordare le opzioni corrette da utilizzare con ``git send-email``, si possono utilizzare le impostazioni di configurazione di Git.

source: If you want to use the Yocto Project to quickly build an image without having to understand concepts, work through the :doc:`/brief-yoctoprojectqs/index` document. You can find "how-to" information in the :doc:`/dev-manual/index`. You can find Yocto Project overview and conceptual information in the :doc:`/overview-manual/index`.
it_it: Per utilizzare Yocto Project per creare rapidamente un'immagine senza dover comprendere i concetti, consultate il documento :doc:`/brief-yoctoprojectqs/index`. Le istruzioni pratiche sono disponibili nel file :doc:`/dev-manual/index`. Una panoramica di Yocto Project e informazioni concettuali sono disponibili nel file :doc:`/overview-manual/index`.

source: If you would like to report a public issue (for example, one with a released CVE number), please report it using the :yocto_bugs:`Security Bugzilla </enter_bug.cgi?product=Security>`.
it_it: Per segnalare un problema pubblico (ad esempio, uno con un numero CVE rilasciato), segnalarlo utilizzando il :yocto_bugs:`Security Bugzilla </enter_bug.cgi?product=Security>`.

source: If you would prefer not to use the ``install-buildtools`` script, you can instead download and run a pre-built :term:`buildtools` installer yourself with the following steps:
it_it: Se si preferisce non utilizzare lo script ``install-buildtools``, si può scaricare ed eseguire autonomamente un programma di installazione precompilato di :term:`buildtools` seguendo questi passaggi:

source: If you're running a pre-built image, download the release and/or BSP tarballs used to build the image.
it_it: Se si sta utilizzando un'immagine precompilata, scaricare i file tarball della release e/o del BSP utilizzati per creare l'immagine.

source: If you're using either of these approaches during development, make sure you remove or de-activate these settings before generating your final production image.
it_it: Se si utilizza uno di questi approcci durante lo sviluppo, si devono rimuovere o disattivare queste impostazioni prima di generare l'immagine di produzione finale.

source: If you're working from git sources, just clone the metadata and BSP layers needed to build the image you'll be booting.
it_it: Se si sta lavorando da sorgenti Git, clonare semplicemente i layer di metadati e BSP necessari per creare l'immagine che si avvierà.

source: If you've already built a stripped image, you can generate debug packages (xxx-dbg) which you can manually install as needed.
it_it: Se è stata già creata un'immagine senza pacchetti, si possono generare pacchetti di debug (xxx-dbg) che si potranno installare manualmente secondo necessità.
